{
  "EXAMPLE_COMPONENT_HELLO": "Hello, {name}. Welcome to {where}!",
  "company_name": "Anhui Xingshen Technology Co., Ltd.",
  "menu_home": "Home",
  "menu_factory_device": "Factory and Device",
  "menu_product": "Product",
  "menu_business": "Business",
  "menu_about": "About",
  "menu_contact": "Contact",
  "menu_recruitment": "Recruitment",
  "sub_menu_factory": "Factory",
  "sub_menu_device": "Devices",
  "smt_patch_title": "SMT Patch",
  "smt_patch_content": "We have 3 fully automatic SMT patch processing production lines and 2 professional plug-in assembly lines. The patch capacity reaches 3 million points per day, plug-ins can reach 100,000 points, with more than 80 employees, including management personnel with 5-8 years of experience in the SMT industry, which can guarantee a quick response to the maintenance of equipment to minimize capacity loss. We can mount PCBs with sizes from 20*20mm to 420*500mm with the smallest package component 0201 in the SMT process. PANASERT multi-functional high-speed placement machine, AOI optical detector, eight-temperature zone reflow soldering, dual wave soldering, and other equipment support production capacity realization and process quality. The whole process has passed ISO 9001: 2015 professional system certification, our management is fully imported into Kingdee ERP management system Implement precise tracking management for the entire production management and material flow.",
  "pcba_processing_title": "PCBA Processing",
  "pcba_processing_content": "We provide PCBA Processing Services, starting from PCB circuit board production, selecting PCB manufacturers, focusing on the quality of circuit boards and PCBA quality control system. Due to decades of experience in the procurement of electronic components, we have maintained long-term cooperation with large brands to ensure the original packaging and procurement channels of components. In the packaging process of components and parts, choose top quality solder paste to ensure the reliability of welding. With an automatic printing machine, Panasonic automatic high-speed placement machine, reflow soldering in the upper and lower eight temperature zones, AOI automatic optical detector etc, which can effectively guarantee the reliability and quality of the electronic packaging process.",
  "pcba_quality_inspection_title": "PCBA Quality Inspection",
  "pcba_quality_inspection_content": "As the current SMT technology continues to mature, the components in the PCBA assembly process become smaller and smaller, making PCBA more and more powerful. At the same time, it also brings huge challenges for testing and inspection. Testing is a crucial step to ensure that high-quality PCBA products are delivered to customers, and inspection and testing can mitigate processing risks.",
  "oem_service_title": "OEM Service",
  "oem_service_content": "In the field of OEM for electronic products, we have a long-term cooperative relationship with large-scale brand component agents to ensure the quality of incoming materials and sufficient supply. In the SMT patch and DIP plug-in link, we use high-precision Panasonic high-speed machines and 10-temperature reflow welding and wave soldering ensure the reliability and quality of welding. Throughout the manufacturing process, we have a strict quality system to control and ensure that problems do not occur.",
  "odm_service_title": "ODM Service",
  "odm_service_content": "As a company with decades of rich experience in electronic manufacturing services, after years of accumulation, we are sufficiently qualified for customers' ODM tasks in electronic products and can provide one-stop ODM services. We have strong hardware and software development strength, the development cycle is greatly shortened and the complete NPI import system, Xingshen R&D engineers can customize exclusive products according to your requirements and provide you with complete ODM services. ",
  "copy_right": "Copy right",
  "support_hotline": "Support",
  "address": "Building 1, Pujian Standardized Plant, Hezhou Avenue, Zhengpugang New District, Maanshan City, Anhui Province",
  "all_categories": "Categories",
  "vehicle_electronics": "Vehicle Electronics",
  "industrial_terminal": "Industrial Terminal",
  "civil_intelligence": "Civil Intelligence",
  "smart_healthcare": "Smart Healthcare",
  "internet_of_things": "Internet",
  "about_company_content": "<div>Anhui Xingshen Technology Co., Ltd. was established in 2021. The enterprise is located in the modern industrial park of Zhengpugang New District, Ma’anshan City, a key development zone in Anhui Province, and it is a benchmark enterprise in the park. It is a government-supported enterprise specializing in PCB design, PCB production, component procurement, SMT processing, product assembly testing, and it is committed to providing clients with small and medium-sized batch samples and mass production of one-stop electronic manufacturing services. Its clients are from well-known large enterprises in all walks of life, and the enterprise is gaining more and more clients' favor through its excellent cost performance.<br /><br />Its main service fields include new energy vehicles, industrial control, information communications, Internet of Things, medical equipment, smart homes, smart meters, aerospace and military, etc. Its professional factories use the SAP system to guarantee cost and planning; production, quality and traceability are guaranteed by the MES system; the third-level standard of IPC610A, which is the highest standard in the industry, is used as the production standard of products, and it is also guaranteed by the ISO9001 and IATF16949 systems.</div>",
  "about_company_title": "About Anhui Xingshen",
  "honor": "Honor",
  "address_title": "Address",
  "phone_title": "Phone",
  "email_title": "E-mail",
  "cell_phone_title": "Cell Phone",
  "product_name": "Components",
  "reception": "Reception",
  "office": "Office",
  "production_line": "Production line",
  "smt_work_shop": "SMT Workshop",
  "recruitment_job": "Job",
  "recruitment_salary": "Salary",
  "recruitment_count": "Count",
  "recruitment_start": "Start Time",
  "recruitment_detail": "Details",
  "general_workers": "General workers",
  "pcb_repairer": "PCB repairer",
  "smt_operator": "SMT operator",
  "sales": "Sales",
  "quality_inspector": "Quality Inspector/Tester",
  "view_detail": "Expand",
  "collapse": "Collapse",
  "negotiable": "Negotiable",
  "count": "Several",
  "job_name": "Job Name",
  "work_address": "Address",
  "job_requirements": "Job Requirement",
  "contact": "Contact",
  "general_workers_job_requirements": "<div>Recognize 26 English letters and have a sense of responsibility.</div>",
  "pcb_repairer_job_requirements": "<div><strong>1. Responsibilities: </strong><br />Responsible for the functional testing and maintenance of the company's PCB circuit boards;<br />Product failure analysis and resolution. <br /><br /><strong>Second, job requirements: </strong><br />Male, 25-45 years old, technical secondary school or above, electronic major is the best, can read circuit diagrams;<br />Understand the knowledge of electronic components, be proficient in operating electric soldering irons, heat guns and other maintenance tools, know how to identify solder joint quality problems and simple circuit functions;<br />Have more than one year experience in PCB board maintenance in SMT factories, and can handle production independently All kinds of defective products produced in the production process, and have certain ability to judge and improve the defective products;<br />Good ability to analyze and judge and solve equipment abnormal conditions;<br />Good communication skills, sense of responsibility, physical Healthy, good character, strong sense of responsibility and communication skills, able to bear hardships and stand hard work. </div>",
  "smt_operator_job_requirements": "<div><strong>Job Description:</strong><br />Responsible for the daily operation, line change and maintenance of the production smt equipment. <br /><br /><strong>Job requirements:</strong><br />High school education or above, more than two years of SMT related work experience;<br />Able to handle simple equipment failures independently;<br /> Familiar with SMT process and software;<br />Familiar with BOM preparation and management. </div>",
  "sales_job_requirements": "<div><strong>Job Description:</strong><br />Responsible for expanding the company's business;<br />Maintaining customer relationships;<br />Assistant sales manager marketing. <br /><br /><strong>Job requirements:</strong><br />Have sales experience in PCB patch, plug-in and assembly;<br />Proficient in OFFICE software, able to have strong data Analytical ability;<br />Good at communication and rich human resources are preferred. </div>",
  "quality_inspector_job_requirements": "<div><strong>Job Description:</strong><br />Responsible for the first smt inspection and dip tour inspection of the product;<br />According to the work order, the quality inspection and supervision of the finished product is carried out to prevent the defective product from flowing into the client. <br /><br /><strong>Job Requirements:</strong><br />Gender: Female;<br />More than one year of SMT quality related work experience;<br />Knowledge of electronic materials and SMT production Process, knowledge of electronic components; basic grasp of product inspection standards. </div>",
  "yinshuaji": "Solder Paste Printer G5",
  "yinshuaji_desc": "<div>G5 automatic solder paste printing machine is a high-precision and high-stability automatic vision printing machine, high-resolution vision processing, high-precision transmission system, suspended adaptive scraper, precise board positioning processing and smart screen frame Clamping structure, compact structure, both accuracy and high flexibility, provides customers with the functions required for efficient and precise printing.</div>",
  "jianceshebei_spi_3d": "3D-SPI inspection equipment",
  "jianceshebei_spi_3d_desc": "<div>has the following features:<br />●Dynamic Mark point recognition<br />●Glue detection<br />●Bad board flight recognition function<br />●Diversified barcode recognition function<br />●Cooperation Printing press closed-loop control<br /> ●MES intelligent manufacturing access</div>",
  "jianceshebei": "Testing equipment YBER PTICS",
  "jianceshebei_desc": "<div>The YBER PTICS SE300 quickly delivers accurate, reliable, repeatable results to meet ever-increasing line cycle requirements. <br />SE 300 Field-proven technology and reliable features improve programming time and inspection setup;<br />SPC charts are provided in the operator user interface;<br />Optional optics extend height inspection range and can measure heights up to 24 mils (610 μm). </div>",
  "tiepianji": "Hitachi High Speed Mounter HITACH ∑-G5S",
  "tiepianji_desc": "<div>Hitachi high-speed placement machine has the characteristics of small size, high compatibility, ultra-high speed, double-arm linkage, cross-area reclaiming, electronic feeding, double-sided operation, wide application range and high precision, especially suitable for large-scale SMT Production. </div>",
  "jianceshebei_aoi_3d": "3D-AOI inspection equipment",
  "jianceshebei_aoi_3d_desc": "<div>YAMAHA YSi-V 3D-AOI has the following features: <br />●2D high-speed, high-resolution 2D inspection, 12-megapixel high-resolution imaging<br /> ●3D height, inclined plane 3D inspection, can check out The inclination and direction of the object can accurately determine whether the shape is correct <br /> ●4D 4-direction oblique camera, using original camera technology, can take one-time oblique shooting of wrong positions and all components in the field of view from 4 directions, and accurately track components. </div>",
  "jianceshebei_1": "Inspection equipment",
  "jianceshebei_1_desc": "<div>●The original use of DISP (Dynamic Image Seamless Splicing Technology) realizes the dynamic seamless splicing of multiple images on the whole board.<br />●Using GPU parallel computing technology to replace traditional CPU computing mode for the first time<br />●Using the perfect combination of ultra-high-resolution image acquisition system and high-precision mechanical transmission system ensures the accurate and stable detection capability of 01005 microchip components and 0.3mm dense pin pitch IC, and fully guarantees the detection efficiency of products and Repeatability.</div>",
  "jianceshebei_gex_ray": "X-ray inspection equipment GEX-RAY",
  "jianceshebei_gex_ray_desc": "<div>GEX-RAY has the following features:<br />●Autonomous cooling and temperature stable control of digital DXR flat panel detector for local high dynamic response for real-time imaging;<br />●180KV/20W high power with a detail resolution of 0.5 microns;<br />●Software programmable and automatic detection with CAD file import;<br />●The data interception speed can be 2 times faster under the same quality image condition by using diamond target;<br />●Optional three-dimensional CT scanning function, to achieve 10 seconds of fast scanning.</div>",
  "huiliuhan": "Nitto wave soldering",
  "huiliuhan_desc": "<div>Nitto wave soldering has the following characteristics:<br />● Transmission system: direct-connected into the plate structure, effectively preventing the guide rail from being deformed.<br />● Preheating system: drawer-type module energy-saving design, any combination of infrared and hot air.<br />● Spray system: digital adjustment of precision control valve, automatic stable supply of flux.<br /> ● Forced cooling system to ensure the cooling rate is 4~6℃/s (adjustable).</div>",
  "huiliuhan_danqi": "Nitrogen reflow soldering",
  "huiliuhan_danqi_desc": "<div>Jintuo nitrogen reflow soldering has the following characteristics:<br />1. The multi-layer insulation furnace design can effectively reduce the temperature of the working environment<br />2. The 15% improvement in heat transfer efficiency can easily cope with more complex and larger welding products<br />3. The fully protected closed design is used in the furnace to effectively protect nitrogen from being lost.</div>",
  "bofenghan": "SMART-450 Reflow Soldering",
  "bofenghan_desc": "<div>The external spray combines the advantages of the built-in and independent spray methods, which can control the spray away from the preheating area in one piece.<br />The inside of the furnace body is free from flux interference, and the electric box is safe and clean<br />The angle of the external spray rail is adjustable, instead of the inlet connection function<br />Reinforced internal thermal insulation and optional external thermal insulation measures effectively reduce heat loss<br />The end face of the spout is fixed, and the spout can be disassembled and assembled quickly.</div>",
  "bofenghan_1": "Reflow soldering",
  "bofenghan_1_desc": "<div>Reflow soldering has the characteristics of high process stability, environmentally friendly resource management, significant energy reduction in sleep mode, nitrogen and cooling water consumption, case temperature up to 15°C higher than room temperature, noise level reduction <70dB, pass Monitoring and comprehensive control of electricity, nitrogen and energy consumption in cooling operations Sustainable insulation, greatly reducing environmental thermal energy consumption, lower maintenance costs, efficient welding slag management, and excellent process tracking capabilities provided by various software tools make REHM unique technical advantages.</div>",
  "bofenghan_xuanzexing": "Selective Wave Soldering ZSW",
  "bofenghan_xuanzexing_desc": "<div>ZSW selective wave soldering has the following characteristics:<br />● Transmission system: direct-connected into the plate structure, effectively preventing the guide rail from being deformed.<br />● Preheating system: drawer-type module energy-saving design, any combination of infrared and hot air.<br />● Spray system: digital adjustment of precision control valve, automatic stable supply of flux.<br /> ● Forced cooling system to ensure the cooling rate is 4~6℃/s (adjustable).</div>",
  "sanfangtufushebei": "Three-proof coating equipment",
  "sanfangtufushebei_desc": "<div>HaiPai three-proof coating machine has the following characteristics:<br />●Accurately realize the selective spraying process of various circuit boards avoiding non-coating areas such as connectors<br />●Accurately realize selective area spraying of various circuit boards<br />●It can realize multi-track spraying such as spot spraying, linear spraying, curve spraying, etc.<br />●It can effectively and uniformly coat the edge of the device, and can eliminate the spray shadow effect<br />● Transmission and control system with high speed, high reliability and high stability.</div>",
  "weixiushebei": "Maintenance equipment",
  "weixiushebei_desc": "<div>The American VJ Summit 1800 has the following features:<br />● SierraMate software with automatic temperature profile setting<br />●Independent heater and pick-up tube control and precise placement performance<br />●High magnification and clarity and reasonable thermal conductivity<br /> ●2.4kW High Power Top Heater DHS Solder Cleaner with Programmable X-Y Stage and 22\"X30\" with 5.6kW Bottom HeaterX-Y table.</div>",
  "fuzhushebei": "Auxiliary equipment - splitter",
  "fuzhushebei_desc": "<div>The milling cutter type PCB splitter RM-285 has the following features:<br />●Full electric control to ensure the long-term working accuracy of the equipment<br />●360 degree 2 indexing rotating work table, improve production efficiency<br />●Independent research and development of control system, safe, stable and easy to upgrade<br />●Reasonable mechanical structure, small size, high cutting precision<br />●Electric control does not require air source; high stability and easy maintenance; simple operation and short changeover time.</div>",
  "fuzhushebei_1": "Auxiliary equipment - engraving machine",
  "fuzhushebei_1_desc": "<div>Bostone 650DK engraving machine has the following features:<br />●Cast iron structure, imported main components, easy to operate, through Auto CAD, MaserCAM and other programming software control operation<br />●Easy and quick maintenance, long service life of equipment<br />●Three-dimensional engraving can be performed on non-metallic materials such as acrylic, PET, PC, ABS, pvc, epoxy resin, synthetic stone, bakelite, graphite, etc.</div>e",
  "": ""
}
